Catalogs/ПричиныПроисшествий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПричиныПроисшествий</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодПоКлассификатору</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПриказа223Н</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПричиныПроисшествий/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

// Возвращает реквизиты справочника, которые образуют естественный ключ для элементов справочника.
//
// Возвращаемое значение:
//  Массив из Строка - имена реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("Код");
	Результат.Добавить("КодПоКлассификатору");
	
	Возврат Результат;
	
КонецФункции

// Конец ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("ПолноеНаименование");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = Данные.ПолноеНаименование;
	
КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Текст", ?(Параметры.СпособПоискаСтроки = СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть, "%", "") + Параметры.СтрокаПоиска + "%");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Классификатор.Ссылка,
	|	Классификатор.ПолноеНаименование
	|ИЗ
	|	Справочник.ПричиныПроисшествий КАК Классификатор
	|ГДЕ
	|	НЕ Классификатор.ЭтоГруппа
	|	И Классификатор.КодПриказа223Н
	|	И Классификатор.ПолноеНаименование ПОДОБНО &Текст";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеВыбора = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.ПолноеНаименование);
	КонецЦикла;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Классификатор.Ссылка,
	|	Классификатор.КодПоКлассификатору
	|ИЗ
	|	Справочник.ПричиныПроисшествий КАК Классификатор
	|ГДЕ
	|	НЕ Классификатор.ЭтоГруппа
	|	И Классификатор.КодПриказа223Н
	|	И Классификатор.КодПоКлассификатору ПОДОБНО &Текст";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.КодПоКлассификатору);
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(Настройки,
		"НесчастныеСлучаи");
КонецПроцедуры

#КонецОбласти

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

// Начальное заполнение причин происшествий.
Процедура НачальноеЗаполнение() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЗначениеИстина
	|ИЗ
	|	Справочник.ПричиныПроисшествий КАК ПричиныПроисшествий
	|ГДЕ
	|	ПричиныПроисшествий.КодПриказа223Н";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	КлассификаторXML = ПолучитьМакет("ПричиныПроисшествий").ПолучитьТекст();
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	Для Каждого СтрокаКлассификатора Из КлассификаторТаблица Цикл
		СправочникСсылка = НайтиПоКоду(СтрокаКлассификатора.Code);
		Если Не ЗначениеЗаполнено(СправочникСсылка) Тогда
			НайденныеСтроки = КлассификаторТаблица.НайтиСтроки(Новый Структура("CodeParent", СтрокаКлассификатора.Code));
			Если НайденныеСтроки.Количество() = 0 Тогда
				СправочникОбъект = СоздатьЭлемент();
			Иначе
				СправочникОбъект = СоздатьГруппу();
			КонецЕсли;
		Иначе
			СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
		КонецЕсли;
		
		СправочникОбъект.Код = СтрокаКлассификатора.Code;
		СправочникОбъект.ПолноеНаименование = СтрокаКлассификатора.Title;
		СправочникОбъект.КодПоКлассификатору = СтрокаКлассификатора.CodeView;
		СправочникОбъект.Родитель = НайтиПоКоду(СтрокаКлассификатора.CodeParent);
		СправочникОбъект.КодПриказа223Н = Истина;
		
		СправочникОбъект.ДополнительныеСвойства.Вставить("ПодборИзКлассификатора");
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
	КонецЦикла;
	
	ПроверитьНаличиеУстаревшихЭлементов();
	
КонецПроцедуры

Процедура ПроверитьНаличиеУстаревшихЭлементов()
	
	КодГруппыУстаревшихЭлементов = ОхранаТруда.КодГруппыУстаревшихЭлементов();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПричиныПроисшествий.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПричиныПроисшествий КАК ПричиныПроисшествий
		|ГДЕ
		|	(ПричиныПроисшествий.Родитель = ЗНАЧЕНИЕ(Справочник.ПричиныПроисшествий.ПустаяСсылка)
		|	ИЛИ ПричиныПроисшествий.Родитель.КодПриказа223Н)
		|	И НЕ ПричиныПроисшествий.КодПриказа223Н
		|	И НЕ ПричиныПроисшествий.Код = &КодГруппыУстаревшихЭлементов";
	
	Запрос.УстановитьПараметр("КодГруппыУстаревшихЭлементов", КодГруппыУстаревшихЭлементов);
	
	// АПК:1328-выкл используется при начальном заполнении ИБ.
	РезультатЗапроса = Запрос.Выполнить();
	// АПК:1328-вкл
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаУстаревшихЭлементов = НайтиПоКоду(КодГруппыУстаревшихЭлементов);
	Если Не ЗначениеЗаполнено(ГруппаУстаревшихЭлементов) Тогда
		ГруппаУстаревшихЭлементовОбъект = СоздатьГруппу();
		ГруппаУстаревшихЭлементовОбъект.Код = КодГруппыУстаревшихЭлементов;
		ГруппаУстаревшихЭлементовОбъект.ПолноеНаименование = НСтр("ru = 'Устаревшие элементы'");
		ГруппаУстаревшихЭлементовОбъект.КодПоКлассификатору = "OLD";
		
		ГруппаУстаревшихЭлементовОбъект.ДополнительныеСвойства.Вставить("ПодборИзКлассификатора");
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ГруппаУстаревшихЭлементовОбъект);
		
		ГруппаУстаревшихЭлементов = ГруппаУстаревшихЭлементовОбъект.Ссылка;
	КонецЕсли;
		
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.Родитель = ГруппаУстаревшихЭлементов;
		
		СправочникОбъект.ДополнительныеСвойства.Вставить("ПодборИзКлассификатора");
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
